#include<stdio.h>

////变量：程序运行过程中其值可以改变的量。变量的值可以在程序运行过程中被修改。变量的值可以通过赋值语句进行修改。
////全局变量：在函数外部定义的变量，作用域为整个文件，生命周期为程序运行期间。
//int a = 60;
//int main()
//{
//	//定义变量:变量名字最好有意义。放置在内存的静态区、堆区用来动态内存管理。
//	//由字母、数字和下划线组成，不能以数字开头，不能使用关键字，长度不能超过63个字符，区分大小写，不能使用空格。
//	//创建时给个初始值叫做初始化。
//	//局部变量：在函数内部定义的变量，作用域仅限于该函数内部，生命周期为函数调用期间。放置在内存的栈区
//	//全局变量和局部变量可以同名，局部变量会覆盖全局变量。（局部变量优先）
//	int age = 20;
//	float weight = 70.5f;
//	float score = 85.5f;
//	int _2b = 2;
//	void test1(){
//		int b = 50;
//		printf("b:%d\n", b); 
//	}
//	//printf("b:%d\n", b);//err.
//	printf("age:%d\n", age);
//	printf("a:%d\n", a);
//	
//	
//	return 0;
//}

////算数操作符：+、-、*、/、%
//int main()
//{
//	int a = 5;
//	int b = 2;
//	printf("a + b = %d\n", a + b);	//加法
//	printf("4 + 5 = %d\n", 4 + 5);	//加法,
//	
//	printf("a - b = %d\n", a - b);	//减法
//	printf("4 - 5 = %d\n", 4 - 5);	//减法
//	//操作符两端有两个操作数，所以叫做双目操作符。
//
//	printf("a * b = %d\n", a * b);	//乘法
//
//	printf("a / b = %d\n", a / b);	//除法
//	//除号两端如果都是整数的话，执行的是整数除法，结果是整数，余数被舍弃。使用%d,%f不行。
//	//如果除号两端有一个是浮点数的话，执行的是浮点数除法，结果是浮点数。
//	printf("a / 2.0 = %f\n", a / 2.0);	//除法
//	int c = 5;
//	//c = (c / 20) * 2;	//整数除法，结果是整数，余数被舍弃。
//	//printf("c = %d\n", c);	//输出c的值，结果是0)
//	c = (c / 20.0) * 2;	//浮点数除法，结果是浮点数。
//	//也不可以，因为c是整型，浮点数赋值给整型会丢失精度。（C为整形，右边返回结果为浮点型，赋值给整形会丢失精度，编译器会报错）
//	float d = (c / 20.0) * 2;	//浮点数除法，结果是浮点数。
//	printf("d = %f\n", d);	//输出d的值，结果是0.5)
//
//	//取模：只能用于整数，得到两个整数的余数。取模运算符%是双目操作符。
//	printf("a %% b = %d\n", a % b);	//取模
//	//用来计算计算一个整数的最后一位	
//	printf("99 %% 10 = %d\n", 99 % 10);	//取模)
//	//正负号由第一个操作数决定，第二个操作数的符号不影响结果。
//	printf("-99 %% 10 = %d\n", -99 % 10);	//取模
//	printf("99 %% -10 = %d\n", 99 % -10);	//取模
//	return 0;
//}


////赋值操作符:=和
//int main()
//{
//	//连续赋值:不推荐
//	int a, b, c;
//	a = b = c = 10;	//连续赋值，先将10赋值给c，再将c的值赋值给b，最后将b的值赋值给a。
//	//等价于：
//	//int a = 10;
//	//int b = 10;
//	//int c = 10;
//
//	//复合赋值操作符:+=、-=、*=、/=、%=，将运算结果赋值给左边的变量。
//	//a += 5;	//等价于a = a + 5;
//	int q = 10;
//	q += 5;	//等价于q = q + 5;
//	//q -= 5;	//等价于q = q - 5;
//	//q *= 5;	//等价于q = q * 5;
//	//q /= 5;	//等价于q = q / 5;
//	//q %= 5;	//等价于q = q % 5;
//	printf("q = %d\n", q);
//	//还有>>=、<<=、&=、|=、^=等
//
//	//单目操作符:++、--，用于变量的自增和自减。++表示自增1，--表示自减1。
//	//++q;	//等价于q = q + 1;先加后用
//	//q++;	//等价于q = q + 1;先用后加
//	printf("%d\n", (++q) + (++q) + (++q));	//err,题就是错的.
//	
//	return 0;
//}

//强制转换
int main()
{
	int a = 10;
	int b = 3;
	float c = (float)a / b;	//强制转换，将a转换为浮点数，再进行除法运算，结果为浮点数。
	printf("c = %f\n", c);	//输出c的值，结果为3.333333
	return 0;
}